micropython/micropython/cc3200/mods/pybtimer.c
        // validate and set the value if we are in edge count mode
        if (_config == TIMER_CFG_A_CAP_COUNT) {
            if (!c_value || c_value > 0xFFFF) {
                // zero or exceeds the maximum value of a 16-bit timer
                goto invalid_args;
            }
            MAP_TimerMatchSet(ch->timer->timer, ch->channel, c_value);
        }

        // disable the callback first
        pyb_timer_channel_callback_disable(ch);

        uint8_t shift = (ch->channel == TIMER_B) ? 8 : 0;
        switch (_config) {
        case TIMER_CFG_A_ONE_SHOT:
        case TIMER_CFG_A_PERIODIC:
            ch->timer->intflags |= TIMER_TIMA_TIMEOUT << shift;
            break;
        case TIMER_CFG_A_CAP_COUNT:
            ch->timer->intflags |= TIMER_CAPA_MATCH << shift;
            // set the match value and make 1 the minimum
            MAP_TimerMatchSet(ch->timer->timer, ch->channel, MAX(1, c_value));
            break;
        case TIMER_CFG_A_CAP_TIME:
            ch->timer->intflags |= TIMER_CAPA_EVENT << shift;
            break;
        case TIMER_CFG_A_PWM:
            // special case for the PWM match interrupt
            ch->timer->intflags |= ((ch->channel & TIMER_A) == TIMER_A) ? TIMER_TIMA_MATCH : TIMER_TIMB_MATCH;
            break;
        default:
            break;
        }
        // special case for a 32-bit timer
        if (ch->channel == (TIMER_A | TIMER_B)) {
           ch->timer->intflags |= (ch->timer->intflags << 8);
        }

        void (*pfnHandler)(void);
        uint32_t intregister;
        switch (ch->timer->timer) {
        case TIMERA0_BASE:
            if (ch->channel == TIMER_B) {
                pfnHandler = &TIMER0BIntHandler;
                intregister = INT_TIMERA0B;
            } else {
                pfnHandler = &TIMER0AIntHandler;
                intregister = INT_TIMERA0A;
            }
            break;
        case TIMERA1_BASE:
            if (ch->channel == TIMER_B) {
                pfnHandler = &TIMER1BIntHandler;
                intregister = INT_TIMERA1B;
            } else {
                pfnHandler = &TIMER1AIntHandler;
                intregister = INT_TIMERA1A;
            }
            break;
        case TIMERA2_BASE:
            if (ch->channel == TIMER_B) {
                pfnHandler = &TIMER2BIntHandler;
                intregister = INT_TIMERA2B;
            } else {
                pfnHandler = &TIMER2AIntHandler;
                intregister = INT_TIMERA2A;
            }
            break;
        default:
            if (ch->channel == TIMER_B) {
                pfnHandler = &TIMER3BIntHandler;
                intregister = INT_TIMERA3B;
            } else {
                pfnHandler = &TIMER3AIntHandler;
                intregister = INT_TIMERA3A;
            }
            break;
        }

        // register the interrupt and configure the priority
        MAP_IntPrioritySet(intregister, priority);
        MAP_TimerIntRegister(ch->timer->timer, ch->channel, pfnHandler);

        // create the callback
        _callback = mpcallback_new (ch, args[1].u_obj, &pyb_timer_channel_cb_methods, true);

        // reload the timer
        uint32_t period_c;
        uint32_t match;
        compute_prescaler_period_and_match_value(ch, &period_c, &match);
        MAP_TimerLoadSet(ch->timer->timer, ch->channel, period_c);

        // enable the callback before returning
        pyb_timer_channel_callback_enable(ch);
    } else if (!_callback) {
        _callback = mpcallback_new (ch, mp_const_none, &pyb_timer_channel_cb_methods, false);
    }
    return _callback;

invalid_args:
    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, mpexception_value_invalid_arguments));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_timer_channel_callback_obj, 1, pyb_timer_channel_callback);

STATIC const mp_map_elem_t pyb_timer_channel_locals_dict_table[] = {
    // instance methods
    { MP_OBJ_NEW_QSTR(MP_QSTR_freq),                 (mp_obj_t)&pyb_timer_channel_freq_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_period),               (mp_obj_t)&pyb_timer_channel_period_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_time),                 (mp_obj_t)&pyb_timer_channel_time_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_event_count),          (mp_obj_t)&pyb_timer_channel_event_count_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_event_time),           (mp_obj_t)&pyb_timer_channel_event_time_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_duty_cycle),           (mp_obj_t)&pyb_timer_channel_duty_cycle_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_callback),             (mp_obj_t)&pyb_timer_channel_callback_obj },
};
STATIC MP_DEFINE_CONST_DICT(pyb_timer_channel_locals_dict, pyb_timer_channel_locals_dict_table);

STATIC const mp_obj_type_t pyb_timer_channel_type = {
    { &mp_type_type },
    .name = MP_QSTR_TimerChannel,
    .print = pyb_timer_channel_print,
    .locals_dict = (mp_obj_t)&pyb_timer_channel_locals_dict,
};

